---
kind: property
id: P:Autodesk.Revit.DB.SpecTypeId.BarDiameter
source: html/71eddf47-d7f7-32b6-fe9f-6868a9fbeae0.htm
---
# Autodesk.Revit.DB.SpecTypeId.BarDiameter Property

Bar Diameter, in discipline Structural.

## Syntax (C#)
```csharp
public static ForgeTypeId BarDiameter { get; }
```